In [1]:
"""
1.Data manipulation:
    .definition- Changing, organizing or preparing data to make it useful and easier 
    to understand. 
    
    .Goal- To clean, Transform and structure raw data for better usability.
    Example: 
            .Organizing a grocery List: Sorting random items into categories 
            like " Fruits" or "Dairy".
            .Fixing erros in a student Record: Correcting missing or wrong grades.
            
2.Data analysis:
    .definition- Extracting patterns, trends, and insights from the data to solve problem and 
    make decision.
    
    .Goal-To clean,Transform and structure raw data for better usability.

3.Who created Pandas and why?
     .Wes Mckinney, a data scientist and software developer, created Pandas in 2008.
     .Reason for creation:
          While working at AQR capital management, Wes faces challenges analyzing 
          large financial datasets.

4.What is pandas ?
    .pandas is a powerful and popular Python library desinged for data manipulation
    (Cleaning,Transforming and structuring data) and 
    data analysis(Finding patterns, trends and insights)

5.What makes Pandas unique?
    key features:
        a.Work seamlessly with structured data formats like CSV and Excel.
        b.Handles missing values easily.
        c.Built on Numpy for fast compulations.
"""

'\n1.Data manipulation:\n    .definition- Changing, organizing or preparing data to make it useful and easier \n    to understand. \n\n    .Goal- To clean, Transform and structure raw data for better usability.\n    Example: \n            .Organizing a grocery List: Sorting random items into categories \n            like " Fruits" or "Dairy".\n            .Fixing erros in a student Record: Correcting missing or wrong grades.\n\n2.Data analysis:\n    .definition- Extracting patterns, trends, and insights from the data to solve problem and \n    make decision.\n\n    .Goal-To clean,Transform and structure raw data for better usability.\n\n3.Who created Pandas and why?\n     .Wes Mckinney, a data scientist and software developer, created Pandas in 2008.\n     .Reason for creation:\n          While working at AQR capital management, Wes faces challenges analyzing \n          large financial datasets.\n\n4.What is pandas ?\n    .pandas is a powerful and popular Python library desinged for data manipulation\n    (Cleaning,Transforming and structuring data) and \n    data analysis(Finding patterns, trends and insights)\n\n5.What makes Pandas unique?\n    key features:\n        a.Work seamlessly with structured data formats like CSV and Excel.\n        b.Handles missing values easily.\n        c.Built on Numpy for fast compulations.\n'

In [2]:
import pandas as pd

In [3]:
# Read the data from CSV file into a dataframe
# encoding- is the process of converting text(Character) into a format that computer stores and read 
df=pd.read_csv(r"C:\Users\anshu\OneDrive\Documents\Excel files\sales_data_sample.csv",encoding="latin1")
df

,ORDERNUMBER,QUANTITYORDERED,PRICEEACH,ORDERLINENUMBER,SALES,ORDERDATE,STATUS,QTR_ID,MONTH_ID,YEAR_ID,...,ADDRESSLINE1,ADDRESSLINE2,CITY,STATE,POSTALCODE,COUNTRY,TERRITORY,CONTACTLASTNAME,CONTACTFIRSTNAME,DEALSIZE
0,10107,30,95.70,2,2871.00,2/24/2003 0:00,Shipped,1,2,2003,...,897 Long Airport Avenue,NaN,NYC,NY,10022,USA,NaN,Yu,Kwai,Small
1,10121,34,81.35,5,2765.90,5/7/2003 0:00,Shipped,2,5,2003,...,59 rue de l'Abbaye,NaN,Reims,NaN,51100,France,EMEA,Henriot,Paul,Small
2,10134,41,94.74,2,3884.34,7/1/2003 0:00,Shipped,3,7,2003,...,27 rue du Colonel Pierre Avia,NaN,Paris,NaN,75508,France,EMEA,Da Cunha,Daniel,Medium
3,10145,45,83.26,6,3746.70,8/25/2003 0:00,Shipped,3,8,2003,...,78934 Hillside Dr.,NaN,Pasadena,CA,90003,USA,NaN,Young,Julie,Medium
4,10159,49,100.00,14,5205.27,10/10/2003 0:00,Shipped,4,10,2003,...,7734 Strong St.,NaN,San Francisco,CA,NaN,USA,NaN,Brown,Julie,Medium
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2818,10350,20,100.00,15,2244.40,12/2/2004 0:00,Shipped,4,12,2004,...,"C/ Moralzarzal, 86",NaN,Madrid,NaN,28034,Spain,EMEA,Freyre,Diego,Small
2819,10373,29,100.00,1,3978.51,1/31/2005 0:00,Shipped,1,1,2005,...,Torikatu 38,NaN,Oulu,NaN,90110,Finland,EMEA,Koskitalo,Pirkko,Medium
2820,10386,43,100.00,4,5417.57,3/1/2005 0:00,Resolved,1,3,2005,...,"C/ Moralzarzal, 86",NaN,Madrid,NaN,28034,Spain,EMEA,Freyre,Diego,Medium
2821,10397,34,62.24,1,2116.16,3/28/2005 0:00,Shipped,1,3,2005,...,1 rue Alsace-Lorraine,NaN,Toulouse,NaN,31000,France,EMEA,Roulet,Annette,Small
2822,10414,47,65.52,9,3079.44,5/6/2005 0:00,On Hold,2,5,2005,...,8616 Spinnaker Dr.,NaN,Boston,MA,51003,USA,NaN,Yoshido,Juri,Medium

In [4]:
# Read the data from Excel file into a dataframe
df2=pd.read_excel(r"C:\Users\anshu\OneDrive\Documents\Excel files\Untitled spreadsheet.xlsx")
df2

,Row ID,Order ID,Order Date,Ship Date,Ship Mode,Customer ID,Customer Name,Segment,Country,City,...,Postal Code,Region,Product ID,Category,Sub-Category,Product Name,Sales,Quantity,Discount,Profit
0,1,CA-2016-152156,2016-11-08,2016-11-11,Second Class,CG-12520,Claire Gute,Consumer,United States,Henderson,...,42420,South,FUR-BO-10001798,Furniture,Bookcases,Bush Somerset Collection Bookcase,261.9600,2,0.00,41.9136
1,2,CA-2016-152156,2016-11-08,2016-11-11,Second Class,CG-12520,Claire Gute,Consumer,United States,Henderson,...,42420,South,FUR-CH-10000454,Furniture,Chairs,"Hon Deluxe Fabric Upholstered Stacking Chairs,...",731.9400,3,0.00,219.5820
2,3,CA-2016-138688,2016-06-12,2016-06-16,Second Class,DV-13045,Darrin Van Huff,Corporate,United States,Los Angeles,...,90036,West,OFF-LA-10000240,Office Supplies,Labels,Self-Adhesive Address Labels for Typewriters b...,14.6200,2,0.00,6.8714
3,4,US-2015-108966,2015-10-11,2015-10-18,Standard Class,SO-20335,Sean O'Donnell,Consumer,United States,Fort Lauderdale,...,33311,South,FUR-TA-10000577,Furniture,Tables,Bretford CR4500 Series Slim Rectangular Table,957.5775,5,0.45,-383.0310
4,5,US-2015-108966,2015-10-11,2015-10-18,Standard Class,SO-20335,Sean O'Donnell,Consumer,United States,Fort Lauderdale,...,33311,South,OFF-ST-10000760,Office Supplies,Storage,Eldon Fold 'N Roll Cart System,22.3680,2,0.20,2.5164
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
9989,9990,CA-2014-110422,2014-01-21,2014-01-23,Second Class,TB-21400,Tom Boeckenhauer,Consumer,United States,Miami,...,33180,South,FUR-FU-10001889,Furniture,Furnishings,Ultra Door Pull Handle,25.2480,3,0.20,4.1028
9990,9991,CA-2017-121258,2017-02-26,2017-03-03,Standard Class,DB-13060,Dave Brooks,Consumer,United States,Costa Mesa,...,92627,West,FUR-FU-10000747,Furniture,Furnishings,Tenex B1-RE Series Chair Mats for Low Pile Car...,91.9600,2,0.00,15.6332
9991,9992,CA-2017-121258,2017-02-26,2017-03-03,Standard Class,DB-13060,Dave Brooks,Consumer,United States,Costa Mesa,...,92627,West,TEC-PH-10003645,Technology,Phones,Aastra 57i VoIP phone,258.5760,2,0.20,19.3932
9992,9993,CA-2017-121258,2017-02-26,2017-03-03,Standard Class,DB-13060,Dave Brooks,Consumer,United States,Costa Mesa,...,92627,West,OFF-PA-10004041,Office Supplies,Paper,"It's Hot Message Books with Stickers, 2 3/4"" x 5""",29.6000,4,0.00,13.3200
9993,9994,CA-2017-119914,2017-05-04,2017-05-09,Second Class,CC-12220,Chris Cortes,Consumer,United States,Westminster,...,92683,West,OFF-AP-10002684,Office Supplies,Appliances,"Acco 7-Outlet Masterpiece Power Center, Wihtou...",243.1600,2,0.00,72.9480

In [5]:
# Read the data from json file into a dataframe
df3=pd.read_json(r"C:\Users\anshu\OneDrive\Documents\Excel files\sample_Data.json")
df2

,Row ID,Order ID,Order Date,Ship Date,Ship Mode,Customer ID,Customer Name,Segment,Country,City,...,Postal Code,Region,Product ID,Category,Sub-Category,Product Name,Sales,Quantity,Discount,Profit
0,1,CA-2016-152156,2016-11-08,2016-11-11,Second Class,CG-12520,Claire Gute,Consumer,United States,Henderson,...,42420,South,FUR-BO-10001798,Furniture,Bookcases,Bush Somerset Collection Bookcase,261.9600,2,0.00,41.9136
1,2,CA-2016-152156,2016-11-08,2016-11-11,Second Class,CG-12520,Claire Gute,Consumer,United States,Henderson,...,42420,South,FUR-CH-10000454,Furniture,Chairs,"Hon Deluxe Fabric Upholstered Stacking Chairs,...",731.9400,3,0.00,219.5820
2,3,CA-2016-138688,2016-06-12,2016-06-16,Second Class,DV-13045,Darrin Van Huff,Corporate,United States,Los Angeles,...,90036,West,OFF-LA-10000240,Office Supplies,Labels,Self-Adhesive Address Labels for Typewriters b...,14.6200,2,0.00,6.8714
3,4,US-2015-108966,2015-10-11,2015-10-18,Standard Class,SO-20335,Sean O'Donnell,Consumer,United States,Fort Lauderdale,...,33311,South,FUR-TA-10000577,Furniture,Tables,Bretford CR4500 Series Slim Rectangular Table,957.5775,5,0.45,-383.0310
4,5,US-2015-108966,2015-10-11,2015-10-18,Standard Class,SO-20335,Sean O'Donnell,Consumer,United States,Fort Lauderdale,...,33311,South,OFF-ST-10000760,Office Supplies,Storage,Eldon Fold 'N Roll Cart System,22.3680,2,0.20,2.5164
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
9989,9990,CA-2014-110422,2014-01-21,2014-01-23,Second Class,TB-21400,Tom Boeckenhauer,Consumer,United States,Miami,...,33180,South,FUR-FU-10001889,Furniture,Furnishings,Ultra Door Pull Handle,25.2480,3,0.20,4.1028
9990,9991,CA-2017-121258,2017-02-26,2017-03-03,Standard Class,DB-13060,Dave Brooks,Consumer,United States,Costa Mesa,...,92627,West,FUR-FU-10000747,Furniture,Furnishings,Tenex B1-RE Series Chair Mats for Low Pile Car...,91.9600,2,0.00,15.6332
9991,9992,CA-2017-121258,2017-02-26,2017-03-03,Standard Class,DB-13060,Dave Brooks,Consumer,United States,Costa Mesa,...,92627,West,TEC-PH-10003645,Technology,Phones,Aastra 57i VoIP phone,258.5760,2,0.20,19.3932
9992,9993,CA-2017-121258,2017-02-26,2017-03-03,Standard Class,DB-13060,Dave Brooks,Consumer,United States,Costa Mesa,...,92627,West,OFF-PA-10004041,Office Supplies,Paper,"It's Hot Message Books with Stickers, 2 3/4"" x 5""",29.6000,4,0.00,13.3200
9993,9994,CA-2017-119914,2017-05-04,2017-05-09,Second Class,CC-12220,Chris Cortes,Consumer,United States,Westminster,...,92683,West,OFF-AP-10002684,Office Supplies,Appliances,"Acco 7-Outlet Masterpiece Power Center, Wihtou...",243.1600,2,0.00,72.9480

In [6]:
# Create a data using dictionary
data={
    "Name":["Ram", "Shayam","Ghanshyam"],
    "Lastname":["Singh","Rajput","Yadav"],
    "Age":[10,18,20],
    "City":["Nagpur","Delhi","Mumbai"]
}

# convert dictionary into a dataframe
df4=pd.DataFrame(data)
df4

        Name Lastname  Age    City
0        Ram    Singh   10  Nagpur
1     Shayam   Rajput   18   Delhi
2  Ghanshyam    Yadav   20  Mumbai

In [7]:
#.to_csv/excelxjson("Name of file.csv/excelxjson, index=False )Save a file in CSV
# index false use for remove the indexes from the data at the time of saving data.
df4.to_csv("Output.csv",index=False)
df4

        Name Lastname  Age    City
0        Ram    Singh   10  Nagpur
1     Shayam   Rajput   18   Delhi
2  Ghanshyam    Yadav   20  Mumbai

In [8]:
# save a file in excel 
df4.to_excel("Output.xlsx",index=False)
df4

        Name Lastname  Age    City
0        Ram    Singh   10  Nagpur
1     Shayam   Rajput   18   Delhi
2  Ghanshyam    Yadav   20  Mumbai

In [9]:
# save a file in json
df4.to_json("Output.json",index=False)
df4

        Name Lastname  Age    City
0        Ram    Singh   10  Nagpur
1     Shayam   Rajput   18   Delhi
2  Ghanshyam    Yadav   20  Mumbai

In [10]:
# Why do we explore the data
# 1. Understand the data set
# 2. Identify the problems
# 3. Plan next steps

In [11]:
#1.Preview the data

# .head(n) select the starting rows from the data when we cant assign a value in head() then by default fetch starting 5 rows
print("Display starting 10 rows")
df3.head(10)

Display starting 10 rows

,id,name,description,price,category,image
0,1,Apple iPhone 12,The Apple iPhone 12 features a 6.1-inch Super ...,999.00,Electronics,https://www.apple.com/newsroom/images/product/...
1,2,Samsung Galaxy S21,The Samsung Galaxy S21 features a 6.2-inch Dyn...,799.00,Electronics,https://images.samsung.com/is/image/samsung/p6...
2,3,Sony PlayStation 5,The Sony PlayStation 5 features an AMD Zen 2-b...,499.99,Electronics,https://www.sony.com/image/44baa604124b770c824...
3,4,LG OLED55CXPUA 55-inch 4K OLED TV,The LG OLED55CXPUA 55-inch 4K OLED TV features...,1599.99,Electronics,https://www.lg.com/us/images/tvs/md07501804/ga...
4,5,Bose QuietComfort 35 II Wireless Headphones,The Bose QuietComfort 35 II Wireless Headphone...,299.00,Electronics,https://assets.bose.com/content/dam/Bose_DAM/W...
5,6,Fitbit Versa 3 Smartwatch,The Fitbit Versa 3 Smartwatch features a built...,229.95,Electronics,https://www.fitbit.com/global/content/dam/fitb...
6,7,KitchenAid Stand Mixer,The KitchenAid Stand Mixer features a 5-quart ...,399.99,Home & Kitchen,https://www.kitchenaid.com/content/dam/global/...
7,8,Dyson V11 Absolute Cordless Vacuum,The Dyson V11 Absolute Cordless Vacuum feature...,699.99,Home Appliances,https://www.dysoncanada.ca/dam/dyson/images/pr...
8,9,Ninja Foodi Smart XL Grill,The Ninja Foodi Smart XL Grill features 6-in-1...,279.99,Home & Kitchen,https://www.ninjakitchen.com/medias/Ninja-OP50...
9,10,Canon EOS Rebel T8i DSLR Camera,The Canon EOS Rebel T8i DSLR Camera features a...,899.00,Electronics,https://www.canon.com.au/-/media/images/produc...

In [12]:
#.tail(n) select the last rows from the dataset.When we cant assign a value in tail() then by default fetch last 5 rows.
print("Display last 10 rows")
df3.tail(10)

Display last 10 rows

,id,name,description,price,category,image
10,11,Apple AirPods Pro,The Apple AirPods Pro feature active noise can...,249.00,Electronics,https://www.apple.com/v/airpods-pro/b/images/m...
11,12,Bose QuietComfort 35 II Wireless Headphones,The Bose QuietComfort 35 II Wireless Headphone...,299.00,Electronics,https://assets.bose.com/content/dam/Bose_DAM/W...
12,13,Fitbit Charge 4 Fitness Tracker,The Fitbit Charge 4 Fitness Tracker features G...,129.95,Electronics,https://www.fitbit.com/global/content/dam/fitb...
13,14,Samsung Galaxy Watch3,The Samsung Galaxy Watch3 features a rotating ...,399.99,Electronics,https://images.samsung.com/is/image/samsung/as...
14,15,Sony WH-1000XM4 Wireless Noise-Cancelling Head...,The Sony WH-1000XM4 Wireless Noise-Cancelling ...,349.99,Electronics,https://www.sony.com/image/1cdd6354c4cd21cc4f7...
15,16,Breville Barista Express Espresso Machine,The Breville Barista Express Espresso Machine ...,699.95,Home & Kitchen,https://www.breville.com/content/dam/breville/...
16,17,Keurig K-Elite Coffee Maker,The Keurig K-Elite Coffee Maker features a str...,169.99,Home & Kitchen,https://www.keurig.com/content/dam/global-ecom...
17,18,iRobot Roomba i7+ Robot Vacuum,The iRobot Roomba i7+ Robot Vacuum features au...,799.99,Home & Kitchen,https://store.irobot.com/default/i7-vacuuming-...
18,19,Ninja Foodi Digital Air Fry Oven,The Ninja Foodi Digital Air Fry Oven features ...,209.99,Home & Kitchen,https://www.ninjakitchen.com/static/img/produc...
19,20,Cuisinart ICE-70 Ice Cream Maker,The Cuisinart ICE-70 Ice Cream Maker features ...,139.99,Home & Kitchen,https://www.cuisinart.com/share/images/product...

In [13]:
# 2.understand the data
# a.Columns, rows?
# b.What type of data?
# c.missing data?

In [14]:
# Return a datatype 
# Retunr range of indexs 
# Return data columns
# Return memory usage
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   id           20 non-null     int64
 1   name         20 non-null     object
 2   description  20 non-null     object
 3   price        20 non-null     float64
 4   category     20 non-null     object
 5   image        20 non-null     object
dtypes: float64(1), int64(1), object(4)
memory usage: 1.1+ KB

In [15]:
df4.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      3 non-null      object
 1   Lastname  3 non-null      object
 2   Age       3 non-null      int64
 3   City      3 non-null      object
dtypes: int64(1), object(3)
memory usage: 228.0+ bytes

In [16]:
df5={
    "Name": ["Anshu","Chandan","Badal", "Aadil","Deepak","Akash","Anil","Aditya","Ayush"],
    "Age":[28,24,30,20,25,34,21,55,34],
    "Salary":[10000,20000,30000,40000,50000,60000,70000,80000,90000],
    "Performance":[32,44,55,66,78,21,69,88,90]
}
df5=pd.DataFrame(df5)
print("Sample Dataframe")
df5

Sample Dataframe

      Name  Age  Salary  Performance
0    Anshu   28   10000           32
1  Chandan   24   20000           44
2    Badal   30   30000           55
3    Aadil   20   40000           66
4   Deepak   25   50000           78
5    Akash   34   60000           21
6     Anil   21   70000           69
7   Aditya   55   80000           88
8    Ayush   34   90000           90

In [17]:
# Describe method- calculate statistics summary of All numeric column 
print("Descriptive statistics")
df5.describe()

Descriptive statistics

             Age        Salary  Performance
count   9.000000      9.000000     9.000000
mean   30.111111  50000.000000    60.333333
std    10.623611  27386.127875    24.264171
min    20.000000  10000.000000    21.000000
25%    24.000000  30000.000000    44.000000
50%    28.000000  50000.000000    66.000000
75%    34.000000  70000.000000    78.000000
max    55.000000  90000.000000    90.000000

In [18]:

# to print maximum and minimum from the data 
print("minimum")
df5.min()
print("maximum")
df5.max()

minimum
maximum

Name           Deepak
Age                55
Salary          90000
Performance        90
dtype: object

In [19]:
"""
1- How big is your dataset?
2-What are the names of columns?

method- shape or columns
"""

'\n1- How big is your dataset?\n2-What are the names of columns?\n\nmethod- shape or columns\n'

In [20]:
# .shape return number of rows and columns in the form of tuple.
print(df5)
print(f'shape:{df5.shape}')
# return .columns names with datatype of columns and in the form of list.
print(f'Columns name: {df5.columns}')

      Name  Age  Salary  Performance
0    Anshu   28   10000           32
1  Chandan   24   20000           44
2    Badal   30   30000           55
3    Aadil   20   40000           66
4   Deepak   25   50000           78
5    Akash   34   60000           21
6     Anil   21   70000           69
7   Aditya   55   80000           88
8    Ayush   34   90000           90
shape:(9, 4)
Columns name: Index(['Name', 'Age', 'Salary', 'Performance'], dtype='object')

In [21]:
df5.to_csv("Employesdata.csv",index=False)

In [22]:
# 1. select Specific column 
# 2. Filter rows
# 3. combine multiple conditions

In [23]:
# 1- select specific column 
# a. return a series
df5["Salary"]

0    10000
1    20000
2    30000
3    40000
4    50000
5    60000
6    70000
7    80000
8    90000
Name: Salary, dtype: int64

In [24]:
# b. return a dataframe multiple columns of data
df5[["Salary","Age","Performance"]]

   Salary  Age  Performance
0   10000   28           32
1   20000   24           44
2   30000   30           55
3   40000   20           66
4   50000   25           78
5   60000   34           21
6   70000   21           69
7   80000   55           88
8   90000   34           90

In [25]:
# 2. Filtering rows with single codition
# using and(&) condition
df5[df5["Salary"]>50000]

     Name  Age  Salary  Performance
5   Akash   34   60000           21
6    Anil   21   70000           69
7  Aditya   55   80000           88
8   Ayush   34   90000           90

In [26]:
#  Filtering rows with single codition
df5[(df5["Salary"]>=50000) & (df5["Salary"]<=80000)]

     Name  Age  Salary  Performance
4  Deepak   25   50000           78
5   Akash   34   60000           21
6    Anil   21   70000           69
7  Aditya   55   80000           88

In [27]:
# Filtering with the help of or(|) condition 
df5[(df5["Age"]>=60) | (df5["Performance"]<=40)]

    Name  Age  Salary  Performance
0  Anshu   28   10000           32
5  Akash   34   60000           21

In [28]:
# -------------------------------------------------------------Advance pandas--------------------------------------------------------------------------

In [29]:
# 1.Adding columns
# we cannot assign the index to store the new column that's why by default it insert at the end of index in dataset 
df5["Bonus"] = df5["Salary"]*0.1
df5

      Name  Age  Salary  Performance   Bonus
0    Anshu   28   10000           32  1000.0
1  Chandan   24   20000           44  2000.0
2    Badal   30   30000           55  3000.0
3    Aadil   20   40000           66  4000.0
4   Deepak   25   50000           78  5000.0
5    Akash   34   60000           21  6000.0
6     Anil   21   70000           69  7000.0
7   Aditya   55   80000           88  8000.0
8    Ayush   34   90000           90  9000.0

In [30]:
# By default totalsalary insert in last index of dataset
df5["Totalsalary"]=df5["Salary"]+df5["Bonus"]
df5

      Name  Age  Salary  Performance   Bonus  Totalsalary
0    Anshu   28   10000           32  1000.0      11000.0
1  Chandan   24   20000           44  2000.0      22000.0
2    Badal   30   30000           55  3000.0      33000.0
3    Aadil   20   40000           66  4000.0      44000.0
4   Deepak   25   50000           78  5000.0      55000.0
5    Akash   34   60000           21  6000.0      66000.0
6     Anil   21   70000           69  7000.0      77000.0
7   Aditya   55   80000           88  8000.0      88000.0
8    Ayush   34   90000           90  9000.0      99000.0

In [33]:
#-----------.insert(column index,"Column name",asign) we  use this to insert a column on specific index.
df5.insert(2,"Gender",["Male"]*9)
df5

      Name  Age Gender  Salary  Performance   Bonus  Totalsalary
0    Anshu   28   Male   10000           32  1000.0      11000.0
1  Chandan   24   Male   20000           44  2000.0      22000.0
2    Badal   30   Male   30000           55  3000.0      33000.0
3    Aadil   20   Male   40000           66  4000.0      44000.0
4   Deepak   25   Male   50000           78  5000.0      55000.0
5    Akash   34   Male   60000           21  6000.0      66000.0
6     Anil   21   Male   70000           69  7000.0      77000.0
7   Aditya   55   Male   80000           88  8000.0      88000.0
8    Ayush   34   Male   90000           90  9000.0      99000.0

In [34]:
df5.insert(0,"Id",[10,20,30,40,50,60,70,80,90])
df5

   Id     Name  Age Gender  Salary  Performance   Bonus  Totalsalary
0  10    Anshu   28   Male   10000           32  1000.0      11000.0
1  20  Chandan   24   Male   20000           44  2000.0      22000.0
2  30    Badal   30   Male   30000           55  3000.0      33000.0
3  40    Aadil   20   Male   40000           66  4000.0      44000.0
4  50   Deepak   25   Male   50000           78  5000.0      55000.0
5  60    Akash   34   Male   60000           21  6000.0      66000.0
6  70     Anil   21   Male   70000           69  7000.0      77000.0
7  80   Aditya   55   Male   80000           88  8000.0      88000.0
8  90    Ayush   34   Male   90000           90  9000.0      99000.0

In [43]:
# Updating value
# .loc[row_index , "Column name"]=asign new value it use to asign a new value on a particular row index
df5.loc[2,"Gender"]=Female
df5

      Name  Age  Gender  Salary  Performance   Bonus  Totalsalary
0    Anshu   28    Male   50000           32  1000.0      55000.0
1  Chandan   24    Male   20000           44  2000.0      22000.0
2    Badal   30  Female   30000           55  3000.0      33000.0
3    Aadil   20    Male   40000           66  4000.0      44000.0
4   Deepak   25    Male   50000           78  5000.0      55000.0
5    Akash   34    Male   60000           21  6000.0      66000.0
6     Anil   21    Male   70000           69  7000.0      77000.0
7   Aditya   55    Male   80000           88  8000.0      88000.0
8    Ayush   34    Male   90000           90  9000.0      99000.0

In [46]:
df5["Salary"]=df5["Salary"]*1.05
df5

      Name  Age  Gender   Salary  Performance   Bonus  Totalsalary
0    Anshu   28    Male  55125.0           32  1000.0      55000.0
1  Chandan   24    Male  22050.0           44  2000.0      22000.0
2    Badal   30  Female  33075.0           55  3000.0      33000.0
3    Aadil   20    Male  44100.0           66  4000.0      44000.0
4   Deepak   25    Male  55125.0           78  5000.0      55000.0
5    Akash   34    Male  66150.0           21  6000.0      66000.0
6     Anil   21    Male  77175.0           69  7000.0      77000.0
7   Aditya   55    Male  88200.0           88  8000.0      88000.0
8    Ayush   34    Male  99225.0           90  9000.0      99000.0